[
    {
        "q": "Which of the following statements are TRUE about the .NET CLR?\nIt   provides   a   language-neutral   development   &   execution environment.\nIt ensures that an application would not be able to access memory that it is not authorized to access.\nIt provides services to run \"managed\" applications.\nThe resources are garbage collected.\nIt provides services to run \"unmanaged\" applications.\n", 
        "options": [
            "Only 1 and 2", 
            "Only 1, 2 and 4", 
            "1, 2, 3, 4", 
            "Only 4 and 5", 
            "Only 3 and 4"
        ], 
        "ans": "C"
    }, 
    {
        "q": "Which of the following are valid .NET CLR JIT performance counters?\nTotal memory used for JIT compilation\nAverage memory used for JIT compilation\nNumber of methods that failed to compile with the standard JIT\nPercentage    of   processor    time    spent    performing    JIT compilation\nPercentage of memory currently dedicated for JIT compilation\n", 
        "options": [
            "1, 5", 
            "3, 4", 
            "1, 2", 
            "4, 5"
        ], 
        "ans": "B"
    }, 
    {
        "q": "Which of the following statements is correct about Managed Code?", 
        "options": [
            "Managed code is the code that  is compiled by the JIT compilers.", 
            "Managed code is the code  where  resources are  Garbage Collected.", 
            "Managed code is the code that runs on top of Windows.", 
            "Managed code is the code that is written to target the services of the CLR.", 
            "Managed code is the code that can run on top of Linux."
        ], 
        "ans": "D"
    }, 
    {
        "q": "Which of the following utilities can be used to compile managed assemblies into processor-specific native code?", 
        "options": [
            "gacutil", 
            "ngen", 
            "sn", 
            "dumpbin", 
            "ildasm"
        ], 
        "ans": "B"
    }, 
    {
        "q": "Which of the following are NOT true about .NET Framework?\nIt provides a consistent object-oriented programming environment whether object code is stored and executed locally, executed locally but Internet-distributed, or executed remotely.\nIt provides a code-execution environment that minimizes software deployment and versioning conflicts.\nIt provides a code-execution environment that promotes safe execution of code, including code created by an unknown or semi-trusted third party.\nIt provides different programming models for Windows-based applications and Web-based applications.\nIt provides an event driven programming model for building Windows Device Drivers.\n", 
        "options": [
            "1, 2", 
            "2, 4", 
            "4, 5", 
            "1, 2, 4"
        ], 
        "ans": "C"
    }, 
    {
        "q": "Which of the following components of the .NET framework provide an extensible set of classes that can be used by any .NET compliant programming language?", 
        "options": [
            ".NET class libraries", 
            "Common Language Runtime", 
            "Common Language Infrastructure", 
            "Component Object Model", 
            "Common Type System"
        ], 
        "ans": "A"
    }, 
    {
        "q": "Which of the following jobs are NOT performed by Garbage Collector?\nFreeing memory on the stack.\nAvoiding memory leaks.\nFreeing memory occupied by unreferenced objects.\nClosing unclosed database collections.\nClosing unclosed files.\n", 
        "options": [
            "1, 2, 3", 
            "3, 5", 
            "1, 4, 5", 
            "3, 4"
        ], 
        "ans": "C"
    }, 
    {
        "q": "Which of the following .NET components can be used to remove unused references from the managed heap?", 
        "options": [
            "Common Language Infrastructure", 
            "CLR", 
            "Garbage Collector", 
            "Class Loader", 
            "CTS"
        ], 
        "ans": "C"
    }, 
    {
        "q": "Which   of  the   following   statements   correctly   define   .NET Framework?", 
        "options": [
            "It is an environment for developing, building, deploying and executing Desktop Applications, Web Applications and Web Services.", 
            "It is an environment for developing, building, deploying and executing only Web Applications.", 
            "It is an environment for developing, building, deploying and executing Distributed Applications.", 
            "It is an environment for developing, building, deploying and executing Web Services.", 
            "It is an environment for development and execution of Windows applications."
        ], 
        "ans": "A"
    }, 
    {
        "q": "Which of the following constitutes the .NET Framework?\nASP.NET Applications\nCLR\nFramework Class Library\nWinForm Applications\nWindows Services\n", 
        "options": [
            "1, 2", 
            "2, 3", 
            "3, 4", 
            "2, 5"
        ], 
        "ans": "B"
    }, 
    {
        "q": "Which of the following assemblies can be stored in Global Assembly Cache?", 
        "options": [
            "Private Assemblies", 
            "Friend Assemblies", 
            "Shared Assemblies", 
            "Public Assemblies", 
            "Protected Assemblies"
        ], 
        "ans": "C"
    }, 
    {
        "q": "Code that targets the Common Language Runtime is known as", 
        "options": [
            "Unmanaged", 
            "Distributed", 
            "Legacy", 
            "Managed Code", 
            "Native Code"
        ], 
        "ans": "D"
    }, 
    {
        "q": "Which of the following statements is correct about the .NET Framework?", 
        "options": [
            ".NET   Framework   uses   DCOM   for   achieving   language interoperability.", 
            ".NET Framework is built on the DCOM technology.", 
            ".NET Framework uses DCOM for making transition between managed and unmanaged code.", 
            ".NET   Framework   uses   DCOM   for   creating   unmanaged applications.", 
            ".NET   Framework   uses   COM+   services   while   creating Distributed Applications."
        ], 
        "ans": "C"
    }, 
    {
        "q": "Which of the following is the root of the .NET type hierarchy?", 
        "options": [
            "System.Object", 
            "System.Type", 
            "System.Base", 
            "System.Parent", 
            "System.Root"
        ], 
        "ans": "A"
    }, 
    {
        "q": "Which of the following benefits do we get on running managed code under CLR?\nType safety of the code running under CLR is assured.\nIt is ensured that an application would not access the memory that it is not authorized to access.\nIt launches separate process for every application running under it.\nThe resources are Garbage collected.\n", 
        "options": [
            "Only 1 and 2", 
            "Only 2, 3 and 4", 
            "Only 1, 2 and 4", 
            "Only 4", 
            "All of the above"
        ], 
        "ans": "E"
    }, 
    {
        "q": "Which of the following security features can .NET applications avail?\nPIN Security\nCode Access Security\nRole Based Security\nAuthentication Security\nBiorhythm Security\n", 
        "options": [
            "1, 4, 5", 
            "2, 5", 
            "2, 3", 
            "3, 4"
        ], 
        "ans": "C"
    }, 
    {
        "q": "Which of the following jobs are done by Common Language Runtime?\nIt provides core services such as memory management, thread management, and remoting.\nIt enforces strict type safety.\nIt provides Code Access Security.\nIt provides Garbage Collection Services.\n", 
        "options": [
            "Only 1 and 2", 
            "Only 3, 4", 
            "Only 1, 3 and 4", 
            "Only 2, 3 and 4", 
            "All of the above"
        ], 
        "ans": "E"
    }, 
    {
        "q": "Which of the following statements are correct about a .NET Assembly?\nIt is the smallest deployable unit.\nEach assembly has only one entry point - Main(), WinMain() or DLLMain().\nAn assembly can be a Shared assembly or a Private assembly.\nAn assembly can contain only code and data.\nAn assembly is always in the form of an EXE file.\n", 
        "options": [
            "1, 2, 3", 
            "2, 4, 5", 
            "1, 3, 5", 
            "1, 2"
        ], 
        "ans": "A"
    }, 
    {
        "q": "Which of the following statements are correct about JIT?\nJIT compiler compiles instructions into machine code at run time.\nThe code compiler by the JIT compiler runs under CLR.\nThe instructions compiled by JIT compilers are written in native code.\nThe instructions compiled by JIT compilers are written in Intermediate Language (IL) code.\nThe method is JIT compiled even if it is not called\n", 
        "options": [
            "1, 2, 3", 
            "2, 4", 
            "3, 4, 5", 
            "1, 2"
        ], 
        "ans": "A"
    }, 
    {
        "q": "Which of the following are parts of the .NET Framework? \nThe Common Language Runtime (CLR) \nThe Framework Class Libraries (FCL) \nMicrosoft Published Web Services \nApplications deployed on IIS \nMobile Applications\n", 
        "options": [
            "Only 1, 2, 3", 
            "Only 1, 2", 
            "Only 1, 2, 4", 
            "Only 4, 5", 
            "All of the above"
        ], 
        "ans": "B"
    }
]